package com.example.traffic;

import android.util.Log;

import com.example.traffic.Modules.Traffic;
import com.example.traffic.Modules.TrafficQuestions;

import java.util.ArrayList;
import java.util.LinkedHashSet;
import java.util.Random;
import java.util.Set;

public  class FillArray {

static ArrayList<Traffic> traffic;

public static ArrayList<Traffic> fillPreventionSigns(){

      traffic=new ArrayList<>();

      traffic.add(new Traffic("ممنوع التجاوز قطعياً  ", "خطين متصلين وفى هذه الحالة لا يسمح بتخطى السيارات فى الإتجاهين . ", "gro1"));
      traffic.add(new Traffic("مسموح التجاوز فى إتجاه واحد [اليمين] ", "الخط متقطع من يسار السائق وفى هذه الحالة يسمح بالتخطى من ناحية الخط المتقطع ولا يسمح للمركبات القادمة فى الإتجاه الاخر . ", "gro2"));
      traffic.add(new Traffic("مسموح التجاوز فى إتجاه واحد[اليسار] ", "الخط متقطع من يمين السائق وفى هذه الحالة يسمح بالتخطى للمركبات القادمة فى الإتجاه الاخر من ناحية الخط المتقطع . ", "gro3"));
      traffic.add(new Traffic("منطقه فاصله بين إتجاهين ", "جزيره مرسومه ويجب عدم الدخول فيها أو الإنتظار بها أو السير عليها أو الإنحراف من خلالها . ", "gro4"));
      traffic.add(new Traffic("خط متقطع [مسموح بالتخطى] ", "الخط الأبيض المتقطع بين الحارات يشير إلى إمكانية التخطى لتغيير الحارات إذا كانت حالة الطريق تسمح بذلك . ", "gro5"));
      traffic.add(new Traffic("إلتقاء الطريق بآخر رئيسى ", "يدل على إنتهاء حاره أو إنتهاء طريق والدخول على طريق جديد له الأولوية . ", "gro6"));
      traffic.add(new Traffic("خط أبيض يمين الطريق ", "الخط الأبيض المتصل الموجود على كلا الجانبين للطرق ذات الاتجاهين أو الجانب الايمن للطرق ذات الإتجاه الواحد وفى هذه الحالة يجب عدم القيادة على يمين الخط . ", "gro7"));
      traffic.add(new Traffic("خط أبيض وسط الطريق ", "الخط الأبيض بين الحارات يوضح عدم إمكانية تخطيه وأن تظل بحارتك إلا إذا كان هناك موقف خاص يستدعى تغيير الحارة بشرط سماح حالة الطريق بذلك . ", "gro8"));
      traffic.add(new Traffic("خط أصفر متصل يسار الطريق ", "خط أصفر متصل يحدد الحافة اليسرى للطرق ذات الاتجاه الواحد . ", "gro9"));
      traffic.add(new Traffic("خط أصفر متصل وسط الطريق ", "خط أصفر متصل يفصل حركة المرور فى الاتجاهين المتضادين . ", "gro10"));
      traffic.add(new Traffic("خط أصفر متقطع ", "الخط الاصفر المتقطع بين الحارات ذات الاتجاهات المتضاده ويعنى إمكانية تخطيه للعبور بشرط أن يكون ذلك آمناً ووفقاً لحالة الطريق . ", "gro11"));
      traffic.add(new Traffic(" [أصفر متقطع] ", "وتعنى هذه الإشارة أن يقوم قائد السيارة بتهدئة سرعة السيارة أثناء عبوره وملاحظة الاتجاهات الاخرى . ", "lig1"));
      traffic.add(new Traffic(" [أصفر ] تهيأ للوقوف ", "وتعنى هذه الاشارة أن يقوم قائد السيارة بتقدير سرعة السيارة إستعداداً للتوقف . ", "lig2"));
      traffic.add(new Traffic(" [أحمر ] قف ", "وتعنى هذه الاشارة أن يقوم قائد السيارة بإيقافها إيقافاً تاماً . ", "lig3"));
      traffic.add(new Traffic(" [أخضر ] سر ", "وتعنى هذه الاشارة أن يقوم قائد السيارة بالسير عابراً الاشارة . ", "lig4"));
      traffic.add(new Traffic(" [أخضر] أعبر بحرص ", "وتعنى هذه الاشارة أنه يجب على المشاه العبور بحرص ", "lig5"));
      traffic.add(new Traffic("[أحمر ] قف ", "وتعنى هذه الاشارة أنه يجب على المشاه التوقف التام . ", "li6"));

    return traffic;

}

public static ArrayList<Traffic> fillReportSigns(){


      traffic=new ArrayList<>();

      traffic.add(new Traffic("أمامك إتجاه إجبارى لليمين ", "تعنى هذه العلامة أن الطريق يتجه لليمين ولا يوجد سوى هذا الإتجاه لسير المركبات به . ", "nec1"));
      traffic.add(new Traffic("إتجاهات سير إجبارى ", "هذه العلامة تعنى أنه يجب على جميع المركبات الإلتزام بالسير إجبارياً للأمام ولليسار  . ", "nec2"));
      traffic.add(new Traffic("إلزم اليسار ", "هذه العلامة تعنى أنه يجب على جميع المركبات الإلتزام بيسار الطريق . ", "nec3"));
      traffic.add(new Traffic("إلزم اليمين ", "هذه العلامة تعنى أنه يجب على جميع المركبات الإلتزام بيمين الطريق . ", "nec4"));
      traffic.add(new Traffic("   إتجاه مستدير ", "هذه العلامة تعنى أن الطريق أمامك دائرى وإجبارى الدوران مع الطريق . ", "nec5"));
      traffic.add(new Traffic("إتجاه إجبارى للأمام ", "تعنى هذه العلامة بأن إتجاه السير بالطريق يكون إجبارى للأمام ولا يوجد دورانات . ", "nec6"));
      traffic.add(new Traffic("إلزم اليسار ", "هذه العلامة تلزم قائدى المركبات بالإلتزام بالسير جهة اليسار وغالباً ما تكون عند مخارج الطرق . ", "nec7"));
      traffic.add(new Traffic("أمامك إتجاه إجبارى لليسار ", "هذه العلامة تعنى أن الطريق يتجه لليسار ولا يوجد سوى الاتجاه لليسار لسير المركبات . ", "nec8"));
      traffic.add(new Traffic("طريق إجبارى للمشاه ", "هذه العلامة تعنى أن هذا الطريق إجبارى لعبور المشاه ولا يجوز إستخدام الطرق الاخرى . ", "nec9"));
      traffic.add(new Traffic("أقل سرعه إجباريه ", "هذه العلامة تعنى أنه يجب على قائدى المركبات بعدم زيادة السرعة عن30 كم / ساعه . ", "nec10"));
      traffic.add(new Traffic("أمامك إتجاه إجبارى لليمين ولليسار ", "هذه العلامة تعنى أنه يجب على جميع قائدى المركبات الدوران إجبارياً لليمين واليسار . ", "nec11"));
      traffic.add(new Traffic("المرور على أحد جانبى الطريق ", "هذه العلامة تعنى أنه يجب المرور على أحد جانبى الطريق الايسر والأيمن . ", "nec12"));
      traffic.add(new Traffic("إنتهاء أولوية المرور ", "هذه العلامة تعنى أنه قد إنتهى أولوية المرور فعلى جميع السيارات إستخدام الطريق . ", "nec13"));
      traffic.add(new Traffic("طريق له الاولوية فى المرور ", "هذه العلامة تعنى أن الطريق له الأولوية فى المرور . ", "nec14"));
      traffic.add(new Traffic("طريق إجبارى للحيوانات ", "هذه العلامه تعنى أن هذا الطريق إجبارياً لعبور الحيوانات ولا يسمح بالسير بطريق آخر . ", "nec15"));
      traffic.add(new Traffic("طريق إجبارى للدراجات ", "هذه العلامه تعنى أن هذا الطريق إجبارياً لسير الدراجات ولا يسمح بالسير بطريق آخر . ", "nec16"));
      traffic.add(new Traffic("مطعم ", "هذه العلامة تعنى أنه يوجد مطعم بهذه المنطقة لمن يرغب فى تناول وجبه غذائية . ", "gui1"));
      traffic.add(new Traffic("محطة وقود ", "هذه العلامة تعنى أنه يوجد محطة للوقود بهذه المنطقة لمن يرغب من قائدى المركبات فى تموين مركبته . ", "gui2"));
      traffic.add(new Traffic("مركز للتصليح ", "هذه العلامة تعنى أنه يوجد مركز للإصلاح بهذه المنطقة فى حالة حدوث أية أعطال بالمركبة . ", "gui3"));
      traffic.add(new Traffic("مركز إسعاف ", "هذه العلامة تعنى أنه يوجد مركز إسعاف بهذه المنطقة . ", "gui4"));
      traffic.add(new Traffic("مخيم ", "هذه العلامة تعنى أنه يوجد مخيم بهذه المنطقة . ", "gui6"));
      traffic.add(new Traffic("موقف أتوبيس ", "هذه العلامة تعنى أنه يوجد موقف أتوبيس لمن يرغب فى الانتقال من مكان إلى مكان آخر بهذه المنطقة بإستخدام المواصلات العامة . ", "gui7"));
      traffic.add(new Traffic("تليفون ", "هذه العلامة تعنى أنه يوجد تليفون بهذه المنطقة لمن يرغب الاتصال التليفونى . ", "gui8"));
      traffic.add(new Traffic("تحويله ", "هذه العلامة تعنى أنه يوجد تحويله ويجب توخى الحذر وتهدئة السرعة . ", "gui9"));
      traffic.add(new Traffic("طريق مغلق ", "هذه العلامة تعنى أن هذا الطريق مغلق من الامام وغير مسموح بالسير فيه . ", "gui10"));
      traffic.add(new Traffic("مستشفى ", "هذه العلامة تعنى أنه يوجد مستشفى بهذه المنطقة فى حالة أية حوادث . ", "gui11"));
      traffic.add(new Traffic("موقف سيارات ", "هذه العلامة تعنى أنه يوجد بهذه المنطقة موقف للسيارات . ", "gui12"));
      traffic.add(new Traffic("الطريق يسمح بمرور سياره واحده ", "هذه العلامة تعنى أن هذا الطريق لا يسمح إلا بمرور سيارة واحده فقط . ", "gui13"));
      traffic.add(new Traffic("بداية الطريق الدولى ", "هذه العلامة تعنى أن الطريق القادم هو بداية طريق دولى ", "gui14"));
      traffic.add(new Traffic("طريق مخصص لسير السيارات ", "هذه العلامة تعنى أن هذا الطريق مخصص لسير السيارات فقط دون المركبات الاخرى . ", "gui15"));
      traffic.add(new Traffic("ذوي الاحتياجات الخاصة ", "هذه العلامة تعنى أن هذا الجزء من الطريق مخصص للأفراد ذوي الاحتياجات الخاصة فقط ويسمح بسير عجلات الخاصه بهم . ", "gui16"));

      return traffic;

}

public static ArrayList<Traffic> fillLandSigns(){

            traffic=new ArrayList<>();


            traffic.add(new Traffic("منوع الانتظار ", "ممنوع الإنتظار حيث أن الإنتظار غير مسموح به في هذا المكان . ", "for1"));
            traffic.add(new Traffic("ممنوع المرور فى اتجاهين ", "طريق مغلق في الإتجاهين لمرور كافة أنواع المركبات .", "for2"));
            traffic.add(new Traffic("ممنوع الدوران للخلف ", "منع المركبات من الدوران للخلف ", "for3"));
            traffic.add(new Traffic("ممنوع الإتجاه لليسار ", "علي جميع المركبات الإلتزام بعدم الإتجاه إلي جهة اليسار . ", "for4"));
            traffic.add(new Traffic("ممنوع الاتجاه لليمين ", "علي جميع المركبات الإلتزام بعدم الاتجاه إلي جهة اليمين . ", "for5"));
            traffic.add(new Traffic("أقصي ارتفاع 3,5 متر ", "هذه العلامة تعنى أن الطريق لا يسمح بمرور سيارة يزيد إرتفاعها عن 3,5 متراً . ", "for6"));
            traffic.add(new Traffic("ممنوع مرور الدراجات النارية ", "هذه العلامة تعني أن الطريق غير مسموح به مرور الدراجات النارية . ", "for7"));
            traffic.add(new Traffic("ممنوع مرور السيارات ", "هذه العلامة تعنى أن الطريق مغلق للسيارات ومسموح بسير باقي المركبات . ", "for8"));
            traffic.add(new Traffic("ممنوع مرور الأتوبيسات ", "هذه العلامة تعنى أن الطريق غير مسموح لسير الأتوبيسات ومسموح لسير باقي المركبات . ", "for9"));
            traffic.add(new Traffic("ممنوع مرور الشاحنات ", "هذه العلامة تعنى أن الطريق غير مسموح لسير الشاحنات ومسموح لسير باقي المركبات .  ", "for10"));
            traffic.add(new Traffic("ممنوع السيارات والدراجات النارية ", "هذه العلامة تعنى بأن الطريق لا يجوز فيه سير السيارات والدراجات ويجوز السير لباقي المركبات . ", "for11"));
            traffic.add(new Traffic("ممنوع مرور الحيوانات ", "هذه العلامة تعني أنه لا يجوز مرور الحيوانات من هذا الطريق . ", "for12"));
            traffic.add(new Traffic("ممنوع مرور المقطورات ", "هذه العلامة تعني بأن الطريق غير مصرح للسير فيه بالمقطورات ومصرح لباقي المركبات السير عليه . ", "for13"));
            traffic.add(new Traffic("أقل مسافه بين سيارتين 50 متر ", "هذه العلامة تعنى أن لطبيعة الطريق يجب توخى الحذر وأن تكون المسافة بين السيارات لا تقل عن 50 متر منعا لوقوع الحوادث . ", "for14"));
            traffic.add(new Traffic("ممنوع مرور الدراجات ", "هذه العلامة تعنى أنه غير مسموح بمرور الدراجات فقط . ", "for15"));
            traffic.add(new Traffic("ممنوع العربات التي تدفع أو تجر باليد ", "هذه العلامة تعنى أنه غير مصرح للعربات التى تجر أو تدفع باليد بالمرور من هذا الطريق . ", "for16"));
            traffic.add(new Traffic("ممنوع مرور المشاه ", "هذه العلامة تعنى أنه غير مصرح بعبور المشاه من هذا الطريق ودائما ما تكون بطريق سريع أو لعدم وجود إشارة لعبور المشاه . ", "for17"));
            traffic.add(new Traffic("ممنوع إستعمال آلة التنبية ", "هذه العلامة تعنى بأن هذه المنطقة لا يسمح بإستخدام آلة التنبيه بها لوجود سبب ما ( مستشفى علي الطريق أو منطقة سكنيه) . ", "for18"));
            traffic.add(new Traffic("مسموح بإستخدام آلة التنبية ", "هذه العلامة تعنى أنه يصرح بلإستخدام آلة التنبيه . ", "for19"));
            traffic.add(new Traffic("ممنوع الوقوف قطعياً ", "هذه العلامة تعنى أنه ممنوع الوقوف نهائيا لجميع المركبات . ", "for20"));
            traffic.add(new Traffic("ممنوع الدخول ", "هذه العلامة تعنى ممنوع الدخول قطعياً ", "for21"));
            traffic.add(new Traffic("الأولوية للقادم ", "هذه العلامة تعنى بأن هذا الطريق يعطى الافضلية للسيارات القادمة عن السيارات المواجهة لة . ", "for22"));
            traffic.add(new Traffic("ممنوع التخطى للسيارات ", "هذه العلامة تعنى بأن السيارات لا يجوز لها أن تتخطى السيارات التى أمامها وذلك لطبيعة الطريق مثل وجود منحنيات ومرتفعات . ", "for23"));
            traffic.add(new Traffic("نهاية المنع من التخطى ", "هذه العلامة تعنى أنه يسمح لجميع السيارات بتخطى السيارات الامامية وأن حالة الطريق تسمح بإجراء عملية التخطى . ", "for24"));
            traffic.add(new Traffic("ممنوع التخطى للشاحنات ", "هذه العلامة تعنى بأنه لا يجوز للشاحنات تخطى السيارات بهذه المنطقة . ", "for25"));
            traffic.add(new Traffic("حمولة قابلة للإشتعال ", "هذه العلامة تعنى أنه يجب توخى الدقة والحذر اثناء السير نظرا لوجود مواد قابلة للاشتعال . ", "for26"));
            traffic.add(new Traffic("أقصي حمولة 10 طن ", "هذه العلامة تعنى أن الطريق غير مجهزة فنيا لسير مركبات يزيد وزنها عن 10 طن لتأثيرها سلبيا علي الطرق والكبارى . ", "for27"));
            traffic.add(new Traffic("أقصي عرض للسيارات 2 متر ", "هذه العلامة تعنى أن عرض الطريق لا يسمح بمرور مركبات عرضها أكثر من 2 متر ودائما تكون هذه العلامة قبل الانفاق والكبارى العلوية . ", "for28"));
            traffic.add(new Traffic("قف ", "هذه العلامة تعنى الوقوف قطعياً ولخطورة مغزاها ولتنبيه السائقين فقد تم تغيير شكلها من دائرى إلي شكل ثمانى الأضلاع . ", "for29"));
            traffic.add(new Traffic("أقصى حد للسرعة ", "هذه العلامة تعنى أنه لا يجوز لجميع المركبات تجاوز السرعة في هذا الجزء من الطريق لطبيعتها وظروفها . ", "for30"));
            traffic.add(new Traffic("نهاية حد السرعة ", "هذه العلامة تعنى أن يوجد قبلها علامة أخرى تمنع زيادة السرعة وهذه العلامة تعنى نهاية المنع . ", "for30"));
            traffic.add(new Traffic("إشارات مرور ضوئية ", "هذه العلامة تعنى أنه يجب علي قائدى المركبات توخى الحذر وتهدئة السرعة لوجود إشارة ضوئية . ", "ala1"));
            traffic.add(new Traffic("مدارس ", "هذه العلامة تعنى بأن هذه المنطقة يوجد بها مدارس ويجب تهدئة السرعة حفاظا علي أرواح التلاميذ . ", "ala2"));
            traffic.add(new Traffic("عبور مشاه ", "هذه العلامة تعنى أن هذا الجزء من الطريق يوجد عبور مشاه مثل مداخل المدن ويجب توخى الحذر وتهدئة السرعة . ", "ala3"));
            traffic.add(new Traffic("أعمال طريق ", "هذه العلامة تعنى أن هذه المنطقة من الطريق يوجد بها إصلاحات وعلى قائدى المركبات تهدئة السرعة حتى لا يتفاجأ بأعمال الإصلاح . ", "ala4"));
            traffic.add(new Traffic(" منطقة زراعية ", "هذه العلامة تعنى أن هذه المنطقة زراعيه وعلى قائدى المركبات تهدئة السرعة منعاً من مفاجأة أى حيوانات عابرة للطريق . ", "ala5"));
            traffic.add(new Traffic(" إحذر لتوقف طارئ ", "هذه العلامة تعنى أن الطريق يجب السير فيه بحذر حيث يوجد به من الأسباب التى يجب توخى الحذر منها مثل المنحنيات و المرتفعات . ", "ala6"));
            traffic.add(new Traffic(" مرتفع خطر ", "هذه العلامة تعنى أن المرحلة القادمة من الطريق ستكون علي شكل مرتفع فيجب الحذر وزيادة الضغط علي دواسة الوقود . ", "ala7"));
            traffic.add(new Traffic(" منحدر خطر ", "هذه العلامة تحذر قائدى المركبات من المرحلة القادمة من الطريق لأنها ستكون علي شكل منحدر فيجب الحذر وتهدئة السرعة . ", "ala8"));
            traffic.add(new Traffic(" تقاطع سكه حديد بدون بوابه ", "هذه العلامة تعنى تحذير قائدى المركبات من تقاطع سكه حديد بدون بوابه ( مزلقان ) فيجب تهدئة السرعة . ", "ala9"));
            traffic.add(new Traffic(" تقاطع سكه حديد ببوابه ", "هذه العلامة تعنى تحذير قائدى المركبات من تقاطع سكه حديد ببوابه (مزلقان) فيجب تهدئة السرعة . ", "ala10"));
            traffic.add(new Traffic("صخور متساقطه ", "تعنى هذه العلامة أن الطريق أمامك منطقة جبلية وأحيانا يتساقط صخور علي الطريق فيجب الحذر من المنطقة المتساقط منها صخور . ", "ala11"));
            traffic.add(new Traffic(" أسلاك كهربائية ", "تعنى هذه العلامة بأن الطريق به أعمال تركيبات وتوصيلات للأعمدة الكهربائية علي الطريق فكن حذرا حتى لا تتعرض لسقوط الأسلاك . ", "ala12"));
            traffic.add(new Traffic(" جسر متحرك ", "تعنى هذه العلامة أن أمامك جسر متحرك فيجب التأكد من فتح أو إغلاق الجسر لإستكمال السير أو التوقف . ", "ala13"));
            traffic.add(new Traffic(" مطب صناعي ", "تعنى هذه العلامة أن الطريق يوجد به مرتفع أرضي للحد من سرعة المركبات لطبيعة المكان ووجود مدرسة أو مناطق عبور المشاه . ", "ala14"));
            traffic.add(new Traffic(" مطــــار مدرج طيران ", "تعنى هذه العلامة بأن الطريق مجاور لمدرج طيران وألا يتفاجأ بصوت أو منظر الطيارات أثناء صعودها أو هبوطها . ", "ala15"));
            traffic.add(new Traffic(" طريق زلق ", "هذه العلامة تعنى أن الطريق أمام المركبات طريق زلق ( أملس ) فيجب الحذر وتهدئة السرعة أثناء عبور هذه المنطقة من الطريق . ", "ala16"));
            traffic.add(new Traffic(" منحنى يسار ", "تعنى هذه العلامة بأن الطريق يوجد به منحنى لجهة اليسار ويجب تهدئة السرعة . ", "ala17"));
            traffic.add(new Traffic(" منحنى يمين ", "تعنى هذه العلامة بأن الطريق يوجد به منحنى لجهة اليمين فيجب الحذر والالتزام بالحارة اليمنى من الطريق .  ", "ala18"));
            traffic.add(new Traffic(" منحنيان أولهما لليسار ", "تعنى هذه العلامة أن الطريق يوجد به منحنيان وأولهما لجهة اليسار فيجب الحذر وتهدئة السرعة . ", "ala19"));
            traffic.add(new Traffic(" منحنيان أولهما لليمين ", "تعنى هذه العلامة أن الطريق يوجد به منحنيان وأولهما لجهة اليمين فيجب الحذر وتهدئة السرعة والالتزام بالحارة اليمنى من الطريق . ", "ala20"));
            traffic.add(new Traffic(" نهاية الطريق المزدوج ", "هذه العلامة تعنى أنه سيتم دمج الطريقين للقادم والمقابل أى أن الطريق المكون من إتجاهين سينتهى بطريق إتجاه واحد . ", "ala21"));
            traffic.add(new Traffic("طريق فرعى من اليسار ", "تعنى هذه العلامة بأن الطريق في الأمام به نقطة إلتقاء طريق رئيسى مع فرعي من جهة اليسار فيجب الحذر وتهدئة السرعة . ", "ala22"));
            traffic.add(new Traffic(" تقاطع طريق رئيسى مع فرعي ", "تعنى هذه العلامة بأن الطريق الرئيسى سيتقاطع مع طريق فرعي فيجب التوقف والنظر قبل المرور من نقطة التقاطع . ", "ala23"));
            traffic.add(new Traffic(" طريق فرعى من اليمين ", "تعنى هذه العلامة بأن الطريق فى الامام به نقطة إلتقاء طريق رئيسى مع فرعى من جهة اليمين فيجب الحذر وتهدئة السرعة . ", "ala24"));
            traffic.add(new Traffic(" رياح جانبية ", "هذه العلامة تعنى أن هذه المنطقة من الطريق بها رياح فيجب الحذر وتهدئة السرعة منعاً لإرتكاب حوادث نتيجة الاتربه الناتجةعنها . ", "ala25"));
            traffic.add(new Traffic(" أمامك تقاطع طريق ", "هذه العلامة تعنــى أن الطريق سيكون مفترق لإلتقاء الطرق فيجب التوقف والتأكد من خلو الطريق من المركبات قبل التخطى . ", "ala26"));
            traffic.add(new Traffic(" الطريق يضيق من الجانبين ", "تعنى هذه العلامة بأن الطريق سيضيق من الجانبين الايمن والايسر فيجب توخى الحذر والالتزام بالحارة اليمنى من الطريق . ", "ala27"));
            traffic.add(new Traffic(" الطريق يضيق من اليمين ", "تعنى هذه العلامة بأن الطريق سيضيق من الجانب الايمن فيجب توخى الحذر والالتزام بالحارة اليمنى من الطريق . ", "ala28"));
            traffic.add(new Traffic(" طريق دائري ", "تعنى هذه العلامة أن الطريق فى الامام يوجد به تقاطع دائرى فيجب الحذر وتهدئة السرعة . ", "ala29"));
            traffic.add(new Traffic("  الطريق اتجاهين ", " وتعنى هذه العلامة أن الطريق يستخدم للسير فى الاتجاهين القادم والمقابل . ", "ala30"));
            traffic.add(new Traffic(" أمامك طريق رئيسى ", "هذه العلامة تعنى أن الطريق الفرعى المستخدم فى السير سينتهى بطريق رئيسى فيجب الحذر وتهدئة السرعة منعاً لوقوع حوادث .  ", "ala31"));
            traffic.add(new Traffic(" التحذير على مراحل  ", " هذه العلامــة تعنى التحذير على مــراحل مختلفـــة وكل خط أحمر يعنــى 50 متراً [50متر – 100 متر – 150 متر ]. ", "ala32"));

            return traffic;

      }

      static ArrayList<TrafficQuestions> trafficQuestions;


      public static ArrayList<TrafficQuestions> getExamp(){

            traffic=new ArrayList<>();
            trafficQuestions=new ArrayList<>();

            traffic.add(new Traffic("أمامك إتجاه إجبارى لليمين ", "تعنى هذه العلامة أن الطريق يتجه لليمين ولا يوجد سوى هذا الإتجاه لسير المركبات به . ", "nec1"));
            traffic.add(new Traffic("إتجاهات سير إجبارى ", "هذه العلامة تعنى أنه يجب على جميع المركبات الإلتزام بالسير إجبارياً للأمام ولليسار  . ", "nec2"));
            traffic.add(new Traffic("إلزم اليسار ", "هذه العلامة تعنى أنه يجب على جميع المركبات الإلتزام بيسار الطريق . ", "nec3"));
            traffic.add(new Traffic("إلزم اليمين ", "هذه العلامة تعنى أنه يجب على جميع المركبات الإلتزام بيمين الطريق . ", "nec4"));
            traffic.add(new Traffic("   إتجاه مستدير ", "هذه العلامة تعنى أن الطريق أمامك دائرى وإجبارى الدوران مع الطريق . ", "nec5"));
            traffic.add(new Traffic("إتجاه إجبارى للأمام ", "تعنى هذه العلامة بأن إتجاه السير بالطريق يكون إجبارى للأمام ولا يوجد دورانات . ", "nec6"));
            traffic.add(new Traffic("إلزم اليسار ", "هذه العلامة تلزم قائدى المركبات بالإلتزام بالسير جهة اليسار وغالباً ما تكون عند مخارج الطرق . ", "nec7"));
            traffic.add(new Traffic("أمامك إتجاه إجبارى لليسار ", "هذه العلامة تعنى أن الطريق يتجه لليسار ولا يوجد سوى الاتجاه لليسار لسير المركبات . ", "nec8"));
            traffic.add(new Traffic("طريق إجبارى للمشاه ", "هذه العلامة تعنى أن هذا الطريق إجبارى لعبور المشاه ولا يجوز إستخدام الطرق الاخرى . ", "nec9"));
            traffic.add(new Traffic("أقل سرعه إجباريه ", "هذه العلامة تعنى أنه يجب على قائدى المركبات بعدم زيادة السرعة عن30 كم / ساعه . ", "nec10"));
            traffic.add(new Traffic("أمامك إتجاه إجبارى لليمين ولليسار ", "هذه العلامة تعنى أنه يجب على جميع قائدى المركبات الدوران إجبارياً لليمين واليسار . ", "nec11"));
            traffic.add(new Traffic("المرور على أحد جانبى الطريق ", "هذه العلامة تعنى أنه يجب المرور على أحد جانبى الطريق الايسر والأيمن . ", "nec12"));
            traffic.add(new Traffic("إنتهاء أولوية المرور ", "هذه العلامة تعنى أنه قد إنتهى أولوية المرور فعلى جميع السيارات إستخدام الطريق . ", "nec13"));
            traffic.add(new Traffic("طريق له الاولوية فى المرور ", "هذه العلامة تعنى أن الطريق له الأولوية فى المرور . ", "nec14"));
            traffic.add(new Traffic("طريق إجبارى للحيوانات ", "هذه العلامه تعنى أن هذا الطريق إجبارياً لعبور الحيوانات ولا يسمح بالسير بطريق آخر . ", "nec15"));
            traffic.add(new Traffic("طريق إجبارى للدراجات ", "هذه العلامه تعنى أن هذا الطريق إجبارياً لسير الدراجات ولا يسمح بالسير بطريق آخر . ", "nec16"));
            traffic.add(new Traffic("مطعم ", "هذه العلامة تعنى أنه يوجد مطعم بهذه المنطقة لمن يرغب فى تناول وجبه غذائية . ", "gui1"));
            traffic.add(new Traffic("محطة وقود ", "هذه العلامة تعنى أنه يوجد محطة للوقود بهذه المنطقة لمن يرغب من قائدى المركبات فى تموين مركبته . ", "gui2"));
            traffic.add(new Traffic("مركز للتصليح ", "هذه العلامة تعنى أنه يوجد مركز للإصلاح بهذه المنطقة فى حالة حدوث أية أعطال بالمركبة . ", "gui3"));
            traffic.add(new Traffic("مركز إسعاف ", "هذه العلامة تعنى أنه يوجد مركز إسعاف بهذه المنطقة . ", "gui4"));
            traffic.add(new Traffic("مخيم ", "هذه العلامة تعنى أنه يوجد مخيم بهذه المنطقة . ", "gui6"));
            traffic.add(new Traffic("موقف أتوبيس ", "هذه العلامة تعنى أنه يوجد موقف أتوبيس لمن يرغب فى الانتقال من مكان إلى مكان آخر بهذه المنطقة بإستخدام المواصلات العامة . ", "gui7"));
            traffic.add(new Traffic("تليفون ", "هذه العلامة تعنى أنه يوجد تليفون بهذه المنطقة لمن يرغب الاتصال التليفونى . ", "gui8"));
            traffic.add(new Traffic("تحويله ", "هذه العلامة تعنى أنه يوجد تحويله ويجب توخى الحذر وتهدئة السرعة . ", "gui9"));
            traffic.add(new Traffic("طريق مغلق ", "هذه العلامة تعنى أن هذا الطريق مغلق من الامام وغير مسموح بالسير فيه . ", "gui10"));
            traffic.add(new Traffic("مستشفى ", "هذه العلامة تعنى أنه يوجد مستشفى بهذه المنطقة فى حالة أية حوادث . ", "gui11"));
            traffic.add(new Traffic("موقف سيارات ", "هذه العلامة تعنى أنه يوجد بهذه المنطقة موقف للسيارات . ", "gui12"));
            traffic.add(new Traffic("الطريق يسمح بمرور سياره واحده ", "هذه العلامة تعنى أن هذا الطريق لا يسمح إلا بمرور سيارة واحده فقط . ", "gui13"));
            traffic.add(new Traffic("بداية الطريق الدولى ", "هذه العلامة تعنى أن الطريق القادم هو بداية طريق دولى ", "gui14"));
            traffic.add(new Traffic("طريق مخصص لسير السيارات ", "هذه العلامة تعنى أن هذا الطريق مخصص لسير السيارات فقط دون المركبات الاخرى . ", "gui15"));
            traffic.add(new Traffic("ذوي الاحتياجات الخاصة ", "هذه العلامة تعنى أن هذا الجزء من الطريق مخصص للأفراد ذوي الاحتياجات الخاصة فقط ويسمح بسير عجلات الخاصه بهم . ", "gui16"));


            traffic.add(new Traffic("ممنوع التجاوز قطعياً  ", "خطين متصلين وفى هذه الحالة لا يسمح بتخطى السيارات فى الإتجاهين . ", "gro1"));
            traffic.add(new Traffic("مسموح التجاوز فى إتجاه واحد [اليمين] ", "الخط متقطع من يسار السائق وفى هذه الحالة يسمح بالتخطى من ناحية الخط المتقطع ولا يسمح للمركبات القادمة فى الإتجاه الاخر . ", "gro2"));
            traffic.add(new Traffic("مسموح التجاوز فى إتجاه واحد[اليسار] ", "الخط متقطع من يمين السائق وفى هذه الحالة يسمح بالتخطى للمركبات القادمة فى الإتجاه الاخر من ناحية الخط المتقطع . ", "gro3"));
            traffic.add(new Traffic("منطقه فاصله بين إتجاهين ", "جزيره مرسومه ويجب عدم الدخول فيها أو الإنتظار بها أو السير عليها أو الإنحراف من خلالها . ", "gro4"));
            traffic.add(new Traffic("خط متقطع [مسموح بالتخطى] ", "الخط الأبيض المتقطع بين الحارات يشير إلى إمكانية التخطى لتغيير الحارات إذا كانت حالة الطريق تسمح بذلك . ", "gro5"));
            traffic.add(new Traffic("إلتقاء الطريق بآخر رئيسى ", "يدل على إنتهاء حاره أو إنتهاء طريق والدخول على طريق جديد له الأولوية . ", "gro6"));
            traffic.add(new Traffic("خط أبيض يمين الطريق ", "الخط الأبيض المتصل الموجود على كلا الجانبين للطرق ذات الاتجاهين أو الجانب الايمن للطرق ذات الإتجاه الواحد وفى هذه الحالة يجب عدم القيادة على يمين الخط . ", "gro7"));
            traffic.add(new Traffic("خط أبيض وسط الطريق ", "الخط الأبيض بين الحارات يوضح عدم إمكانية تخطيه وأن تظل بحارتك إلا إذا كان هناك موقف خاص يستدعى تغيير الحارة بشرط سماح حالة الطريق بذلك . ", "gro8"));
            traffic.add(new Traffic("خط أصفر متصل يسار الطريق ", "خط أصفر متصل يحدد الحافة اليسرى للطرق ذات الاتجاه الواحد . ", "gro9"));
            traffic.add(new Traffic("خط أصفر متصل وسط الطريق ", "خط أصفر متصل يفصل حركة المرور فى الاتجاهين المتضادين . ", "gro10"));
            traffic.add(new Traffic("خط أصفر متقطع ", "الخط الاصفر المتقطع بين الحارات ذات الاتجاهات المتضاده ويعنى إمكانية تخطيه للعبور بشرط أن يكون ذلك آمناً ووفقاً لحالة الطريق . ", "gro11"));
            traffic.add(new Traffic(" [أصفر متقطع] ", "وتعنى هذه الإشارة أن يقوم قائد السيارة بتهدئة سرعة السيارة أثناء عبوره وملاحظة الاتجاهات الاخرى . ", "lig1"));
            traffic.add(new Traffic(" [أصفر ] تهيأ للوقوف ", "وتعنى هذه الاشارة أن يقوم قائد السيارة بتقدير سرعة السيارة إستعداداً للتوقف . ", "lig2"));
            traffic.add(new Traffic(" [أحمر ] قف ", "وتعنى هذه الاشارة أن يقوم قائد السيارة بإيقافها إيقافاً تاماً . ", "lig3"));
            traffic.add(new Traffic(" [أخضر ] سر ", "وتعنى هذه الاشارة أن يقوم قائد السيارة بالسير عابراً الاشارة . ", "lig4"));
            traffic.add(new Traffic(" [أخضر] أعبر بحرص ", "وتعنى هذه الاشارة أنه يجب على المشاه العبور بحرص ", "lig5"));
            traffic.add(new Traffic("[أحمر ] قف ", "وتعنى هذه الاشارة أنه يجب على المشاه التوقف التام . ", "li6"));


            traffic.add(new Traffic("منوع الانتظار ", "ممنوع الإنتظار حيث أن الإنتظار غير مسموح به في هذا المكان . ", "for1"));
            traffic.add(new Traffic("ممنوع المرور فى اتجاهين ", "طريق مغلق في الإتجاهين لمرور كافة أنواع المركبات .", "for2"));
            traffic.add(new Traffic("ممنوع الدوران للخلف ", "منع المركبات من الدوران للخلف ", "for3"));
            traffic.add(new Traffic("ممنوع الإتجاه لليسار ", "علي جميع المركبات الإلتزام بعدم الإتجاه إلي جهة اليسار . ", "for4"));
            traffic.add(new Traffic("ممنوع الاتجاه لليمين ", "علي جميع المركبات الإلتزام بعدم الاتجاه إلي جهة اليمين . ", "for5"));
            traffic.add(new Traffic("أقصي ارتفاع 3,5 متر ", "هذه العلامة تعنى أن الطريق لا يسمح بمرور سيارة يزيد إرتفاعها عن 3,5 متراً . ", "for6"));
            traffic.add(new Traffic("ممنوع مرور الدراجات النارية ", "هذه العلامة تعني أن الطريق غير مسموح به مرور الدراجات النارية . ", "for7"));
            traffic.add(new Traffic("ممنوع مرور السيارات ", "هذه العلامة تعنى أن الطريق مغلق للسيارات ومسموح بسير باقي المركبات . ", "for8"));
            traffic.add(new Traffic("ممنوع مرور الأتوبيسات ", "هذه العلامة تعنى أن الطريق غير مسموح لسير الأتوبيسات ومسموح لسير باقي المركبات . ", "for9"));
            traffic.add(new Traffic("ممنوع مرور الشاحنات ", "هذه العلامة تعنى أن الطريق غير مسموح لسير الشاحنات ومسموح لسير باقي المركبات .  ", "for10"));
            traffic.add(new Traffic("ممنوع السيارات والدراجات النارية ", "هذه العلامة تعنى بأن الطريق لا يجوز فيه سير السيارات والدراجات ويجوز السير لباقي المركبات . ", "for11"));
            traffic.add(new Traffic("ممنوع مرور الحيوانات ", "هذه العلامة تعني أنه لا يجوز مرور الحيوانات من هذا الطريق . ", "for12"));
            traffic.add(new Traffic("ممنوع مرور المقطورات ", "هذه العلامة تعني بأن الطريق غير مصرح للسير فيه بالمقطورات ومصرح لباقي المركبات السير عليه . ", "for13"));
            traffic.add(new Traffic("أقل مسافه بين سيارتين 50 متر ", "هذه العلامة تعنى أن لطبيعة الطريق يجب توخى الحذر وأن تكون المسافة بين السيارات لا تقل عن 50 متر منعا لوقوع الحوادث . ", "for14"));
            traffic.add(new Traffic("ممنوع مرور الدراجات ", "هذه العلامة تعنى أنه غير مسموح بمرور الدراجات فقط . ", "for15"));
            traffic.add(new Traffic("ممنوع العربات التي تدفع أو تجر باليد ", "هذه العلامة تعنى أنه غير مصرح للعربات التى تجر أو تدفع باليد بالمرور من هذا الطريق . ", "for16"));
            traffic.add(new Traffic("ممنوع مرور المشاه ", "هذه العلامة تعنى أنه غير مصرح بعبور المشاه من هذا الطريق ودائما ما تكون بطريق سريع أو لعدم وجود إشارة لعبور المشاه . ", "for17"));
            traffic.add(new Traffic("ممنوع إستعمال آلة التنبية ", "هذه العلامة تعنى بأن هذه المنطقة لا يسمح بإستخدام آلة التنبيه بها لوجود سبب ما ( مستشفى علي الطريق أو منطقة سكنيه) . ", "for18"));
            traffic.add(new Traffic("مسموح بإستخدام آلة التنبية ", "هذه العلامة تعنى أنه يصرح بلإستخدام آلة التنبيه . ", "for19"));
            traffic.add(new Traffic("ممنوع الوقوف قطعياً ", "هذه العلامة تعنى أنه ممنوع الوقوف نهائيا لجميع المركبات . ", "for20"));
            traffic.add(new Traffic("ممنوع الدخول ", "هذه العلامة تعنى ممنوع الدخول قطعياً ", "for21"));
            traffic.add(new Traffic("الأولوية للقادم ", "هذه العلامة تعنى بأن هذا الطريق يعطى الافضلية للسيارات القادمة عن السيارات المواجهة لة . ", "for22"));
            traffic.add(new Traffic("ممنوع التخطى للسيارات ", "هذه العلامة تعنى بأن السيارات لا يجوز لها أن تتخطى السيارات التى أمامها وذلك لطبيعة الطريق مثل وجود منحنيات ومرتفعات . ", "for23"));
            traffic.add(new Traffic("نهاية المنع من التخطى ", "هذه العلامة تعنى أنه يسمح لجميع السيارات بتخطى السيارات الامامية وأن حالة الطريق تسمح بإجراء عملية التخطى . ", "for24"));
            traffic.add(new Traffic("ممنوع التخطى للشاحنات ", "هذه العلامة تعنى بأنه لا يجوز للشاحنات تخطى السيارات بهذه المنطقة . ", "for25"));
            traffic.add(new Traffic("حمولة قابلة للإشتعال ", "هذه العلامة تعنى أنه يجب توخى الدقة والحذر اثناء السير نظرا لوجود مواد قابلة للاشتعال . ", "for26"));
            traffic.add(new Traffic("أقصي حمولة 10 طن ", "هذه العلامة تعنى أن الطريق غير مجهزة فنيا لسير مركبات يزيد وزنها عن 10 طن لتأثيرها سلبيا علي الطرق والكبارى . ", "for27"));
            traffic.add(new Traffic("أقصي عرض للسيارات 2 متر ", "هذه العلامة تعنى أن عرض الطريق لا يسمح بمرور مركبات عرضها أكثر من 2 متر ودائما تكون هذه العلامة قبل الانفاق والكبارى العلوية . ", "for28"));
            traffic.add(new Traffic("قف ", "هذه العلامة تعنى الوقوف قطعياً ولخطورة مغزاها ولتنبيه السائقين فقد تم تغيير شكلها من دائرى إلي شكل ثمانى الأضلاع . ", "for29"));
            traffic.add(new Traffic("أقصى حد للسرعة ", "هذه العلامة تعنى أنه لا يجوز لجميع المركبات تجاوز السرعة في هذا الجزء من الطريق لطبيعتها وظروفها . ", "for30"));
            traffic.add(new Traffic("نهاية حد السرعة ", "هذه العلامة تعنى أن يوجد قبلها علامة أخرى تمنع زيادة السرعة وهذه العلامة تعنى نهاية المنع . ", "for30"));
            traffic.add(new Traffic("إشارات مرور ضوئية ", "هذه العلامة تعنى أنه يجب علي قائدى المركبات توخى الحذر وتهدئة السرعة لوجود إشارة ضوئية . ", "ala1"));
            traffic.add(new Traffic("مدارس ", "هذه العلامة تعنى بأن هذه المنطقة يوجد بها مدارس ويجب تهدئة السرعة حفاظا علي أرواح التلاميذ . ", "ala2"));
            traffic.add(new Traffic("عبور مشاه ", "هذه العلامة تعنى أن هذا الجزء من الطريق يوجد عبور مشاه مثل مداخل المدن ويجب توخى الحذر وتهدئة السرعة . ", "ala3"));
            traffic.add(new Traffic("أعمال طريق ", "هذه العلامة تعنى أن هذه المنطقة من الطريق يوجد بها إصلاحات وعلى قائدى المركبات تهدئة السرعة حتى لا يتفاجأ بأعمال الإصلاح . ", "ala4"));
            traffic.add(new Traffic(" منطقة زراعية ", "هذه العلامة تعنى أن هذه المنطقة زراعيه وعلى قائدى المركبات تهدئة السرعة منعاً من مفاجأة أى حيوانات عابرة للطريق . ", "ala5"));
            traffic.add(new Traffic(" إحذر لتوقف طارئ ", "هذه العلامة تعنى أن الطريق يجب السير فيه بحذر حيث يوجد به من الأسباب التى يجب توخى الحذر منها مثل المنحنيات و المرتفعات . ", "ala6"));
            traffic.add(new Traffic(" مرتفع خطر ", "هذه العلامة تعنى أن المرحلة القادمة من الطريق ستكون علي شكل مرتفع فيجب الحذر وزيادة الضغط علي دواسة الوقود . ", "ala7"));
            traffic.add(new Traffic(" منحدر خطر ", "هذه العلامة تحذر قائدى المركبات من المرحلة القادمة من الطريق لأنها ستكون علي شكل منحدر فيجب الحذر وتهدئة السرعة . ", "ala8"));
            traffic.add(new Traffic(" تقاطع سكه حديد بدون بوابه ", "هذه العلامة تعنى تحذير قائدى المركبات من تقاطع سكه حديد بدون بوابه ( مزلقان ) فيجب تهدئة السرعة . ", "ala9"));
            traffic.add(new Traffic(" تقاطع سكه حديد ببوابه ", "هذه العلامة تعنى تحذير قائدى المركبات من تقاطع سكه حديد ببوابه (مزلقان) فيجب تهدئة السرعة . ", "ala10"));
            traffic.add(new Traffic("صخور متساقطه ", "تعنى هذه العلامة أن الطريق أمامك منطقة جبلية وأحيانا يتساقط صخور علي الطريق فيجب الحذر من المنطقة المتساقط منها صخور . ", "ala11"));
            traffic.add(new Traffic(" أسلاك كهربائية ", "تعنى هذه العلامة بأن الطريق به أعمال تركيبات وتوصيلات للأعمدة الكهربائية علي الطريق فكن حذرا حتى لا تتعرض لسقوط الأسلاك . ", "ala12"));
            traffic.add(new Traffic(" جسر متحرك ", "تعنى هذه العلامة أن أمامك جسر متحرك فيجب التأكد من فتح أو إغلاق الجسر لإستكمال السير أو التوقف . ", "ala13"));
            traffic.add(new Traffic(" مطب صناعي ", "تعنى هذه العلامة أن الطريق يوجد به مرتفع أرضي للحد من سرعة المركبات لطبيعة المكان ووجود مدرسة أو مناطق عبور المشاه . ", "ala14"));
            traffic.add(new Traffic(" مطــــار مدرج طيران ", "تعنى هذه العلامة بأن الطريق مجاور لمدرج طيران وألا يتفاجأ بصوت أو منظر الطيارات أثناء صعودها أو هبوطها . ", "ala15"));
            traffic.add(new Traffic(" طريق زلق ", "هذه العلامة تعنى أن الطريق أمام المركبات طريق زلق ( أملس ) فيجب الحذر وتهدئة السرعة أثناء عبور هذه المنطقة من الطريق . ", "ala16"));
            traffic.add(new Traffic(" منحنى يسار ", "تعنى هذه العلامة بأن الطريق يوجد به منحنى لجهة اليسار ويجب تهدئة السرعة . ", "ala17"));
            traffic.add(new Traffic(" منحنى يمين ", "تعنى هذه العلامة بأن الطريق يوجد به منحنى لجهة اليمين فيجب الحذر والالتزام بالحارة اليمنى من الطريق .  ", "ala18"));
            traffic.add(new Traffic(" منحنيان أولهما لليسار ", "تعنى هذه العلامة أن الطريق يوجد به منحنيان وأولهما لجهة اليسار فيجب الحذر وتهدئة السرعة . ", "ala19"));
            traffic.add(new Traffic(" منحنيان أولهما لليمين ", "تعنى هذه العلامة أن الطريق يوجد به منحنيان وأولهما لجهة اليمين فيجب الحذر وتهدئة السرعة والالتزام بالحارة اليمنى من الطريق . ", "ala20"));
            traffic.add(new Traffic(" نهاية الطريق المزدوج ", "هذه العلامة تعنى أنه سيتم دمج الطريقين للقادم والمقابل أى أن الطريق المكون من إتجاهين سينتهى بطريق إتجاه واحد . ", "ala21"));
            traffic.add(new Traffic("طريق فرعى من اليسار ", "تعنى هذه العلامة بأن الطريق في الأمام به نقطة إلتقاء طريق رئيسى مع فرعي من جهة اليسار فيجب الحذر وتهدئة السرعة . ", "ala22"));
            traffic.add(new Traffic(" تقاطع طريق رئيسى مع فرعي ", "تعنى هذه العلامة بأن الطريق الرئيسى سيتقاطع مع طريق فرعي فيجب التوقف والنظر قبل المرور من نقطة التقاطع . ", "ala23"));
            traffic.add(new Traffic(" طريق فرعى من اليمين ", "تعنى هذه العلامة بأن الطريق فى الامام به نقطة إلتقاء طريق رئيسى مع فرعى من جهة اليمين فيجب الحذر وتهدئة السرعة . ", "ala24"));
            traffic.add(new Traffic(" رياح جانبية ", "هذه العلامة تعنى أن هذه المنطقة من الطريق بها رياح فيجب الحذر وتهدئة السرعة منعاً لإرتكاب حوادث نتيجة الاتربه الناتجةعنها . ", "ala25"));
            traffic.add(new Traffic(" أمامك تقاطع طريق ", "هذه العلامة تعنــى أن الطريق سيكون مفترق لإلتقاء الطرق فيجب التوقف والتأكد من خلو الطريق من المركبات قبل التخطى . ", "ala26"));
            traffic.add(new Traffic(" الطريق يضيق من الجانبين ", "تعنى هذه العلامة بأن الطريق سيضيق من الجانبين الايمن والايسر فيجب توخى الحذر والالتزام بالحارة اليمنى من الطريق . ", "ala27"));
            traffic.add(new Traffic(" الطريق يضيق من اليمين ", "تعنى هذه العلامة بأن الطريق سيضيق من الجانب الايمن فيجب توخى الحذر والالتزام بالحارة اليمنى من الطريق . ", "ala28"));
            traffic.add(new Traffic(" طريق دائري ", "تعنى هذه العلامة أن الطريق فى الامام يوجد به تقاطع دائرى فيجب الحذر وتهدئة السرعة . ", "ala29"));
            traffic.add(new Traffic("  الطريق اتجاهين ", " وتعنى هذه العلامة أن الطريق يستخدم للسير فى الاتجاهين القادم والمقابل . ", "ala30"));
            traffic.add(new Traffic(" أمامك طريق رئيسى ", "هذه العلامة تعنى أن الطريق الفرعى المستخدم فى السير سينتهى بطريق رئيسى فيجب الحذر وتهدئة السرعة منعاً لوقوع حوادث .  ", "ala31"));
            traffic.add(new Traffic(" التحذير على مراحل  ", " هذه العلامــة تعنى التحذير على مــراحل مختلفـــة وكل خط أحمر يعنــى 50 متراً [50متر – 100 متر – 150 متر ]. ", "ala32"));




for(int i= 0 ; i<10; i++){

        int result = new Random().nextInt(traffic.size()-1) + 1;
        int answer1 = new Random().nextInt(traffic.size()-1) + 1;
        int answer2 = new Random().nextInt(traffic.size()-1) + 1;

    trafficQuestions.add(
            new TrafficQuestions(
                    traffic.get(result).getTrafficSignImage(),
                    traffic.get(result).getTrafficSignName(),
                    traffic.get(answer1).getTrafficSignName(),
                    traffic.get(answer2).getTrafficSignName(),
                    traffic.get(result).getTrafficSignName()));
            }

            return trafficQuestions;
      }

}
